app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes" ORDER BY "recipes"."created_at" DESC
---
  def index
    @recipe = Recipe.all.order(created_at: :desc)

SELECT COUNT(*) FROM "recipes"
---
  def count
    @recipe = Recipe.all.length

INSERT INTO "recipes" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "aa"], ["content", "aa"], ["created_at", "2022-08-12 10:19:44.626625"], ["updated_at", "2022-08-12 10:19:44.626625"]]
---
  def create
    Recipe.create!(title: @params[:title],content: @params[:content])

SELECT "recipes".* FROM "recipes" WHERE "recipes"."title" IS NULL LIMIT ?  [["LIMIT", 1]]
---
  def show

    recipe = Recipe.find_by(title: @params[:title])